MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS808/mcu.h
#define _ADMOD0H_SIGN8_POSITION                  0x00000000
#define _ADMOD0H_SIGN8_MASK                      0x00000001
#define _ADMOD0H_SIGN8_LENGTH                    0x00000001

#define _ADMOD0H_DIFF8_POSITION                  0x00000001
#define _ADMOD0H_DIFF8_MASK                      0x00000002
#define _ADMOD0H_DIFF8_LENGTH                    0x00000001

#define _ADMOD0H_SIGN9_POSITION                  0x00000002
#define _ADMOD0H_SIGN9_MASK                      0x00000004
#define _ADMOD0H_SIGN9_LENGTH                    0x00000001

#define _ADMOD0H_DIFF9_POSITION                  0x00000003
#define _ADMOD0H_DIFF9_MASK                      0x00000008
#define _ADMOD0H_DIFF9_LENGTH                    0x00000001

#define _ADMOD0H_SIGN10_POSITION                 0x00000004
#define _ADMOD0H_SIGN10_MASK                     0x00000010
#define _ADMOD0H_SIGN10_LENGTH                   0x00000001

#define _ADMOD0H_DIFF10_POSITION                 0x00000005
#define _ADMOD0H_DIFF10_MASK                     0x00000020
#define _ADMOD0H_DIFF10_LENGTH                   0x00000001

#define _ADMOD0H_SIGN11_POSITION                 0x00000006
#define _ADMOD0H_SIGN11_MASK                     0x00000040
#define _ADMOD0H_SIGN11_LENGTH                   0x00000001

#define _ADMOD0H_DIFF11_POSITION                 0x00000007
#define _ADMOD0H_DIFF11_MASK                     0x00000080
#define _ADMOD0H_DIFF11_LENGTH                   0x00000001

#define _ADMOD0H_SIGN12_POSITION                 0x00000008
#define _ADMOD0H_SIGN12_MASK                     0x00000100
#define _ADMOD0H_SIGN12_LENGTH                   0x00000001

#define _ADMOD0H_DIFF12_POSITION                 0x00000009
#define _ADMOD0H_DIFF12_MASK                     0x00000200
#define _ADMOD0H_DIFF12_LENGTH                   0x00000001

#define _ADMOD0H_SIGN13_POSITION                 0x0000000A
#define _ADMOD0H_SIGN13_MASK                     0x00000400
#define _ADMOD0H_SIGN13_LENGTH                   0x00000001

#define _ADMOD0H_DIFF13_POSITION                 0x0000000B
#define _ADMOD0H_DIFF13_MASK                     0x00000800
#define _ADMOD0H_DIFF13_LENGTH                   0x00000001

#define _ADMOD0H_SIGN14_POSITION                 0x0000000C
#define _ADMOD0H_SIGN14_MASK                     0x00001000
#define _ADMOD0H_SIGN14_LENGTH                   0x00000001

#define _ADMOD0H_DIFF14_POSITION                 0x0000000D
#define _ADMOD0H_DIFF14_MASK                     0x00002000
#define _ADMOD0H_DIFF14_LENGTH                   0x00000001

#define _ADMOD0H_SIGN15_POSITION                 0x0000000E
#define _ADMOD0H_SIGN15_MASK                     0x00004000
#define _ADMOD0H_SIGN15_LENGTH                   0x00000001

#define _ADMOD0H_DIFF15_POSITION                 0x0000000F
#define _ADMOD0H_DIFF15_MASK                     0x00008000
#define _ADMOD0H_DIFF15_LENGTH                   0x00000001

#define _ADMOD1L_SIGN16_POSITION                 0x00000000
#define _ADMOD1L_SIGN16_MASK                     0x00000001
#define _ADMOD1L_SIGN16_LENGTH                   0x00000001

#define _ADMOD1L_DIFF16_POSITION                 0x00000001
#define _ADMOD1L_DIFF16_MASK                     0x00000002
#define _ADMOD1L_DIFF16_LENGTH                   0x00000001

#define _ADMOD1L_SIGN17_POSITION                 0x00000002
#define _ADMOD1L_SIGN17_MASK                     0x00000004
#define _ADMOD1L_SIGN17_LENGTH                   0x00000001

#define _ADMOD1L_DIFF17_POSITION                 0x00000003
#define _ADMOD1L_DIFF17_MASK                     0x00000008
#define _ADMOD1L_DIFF17_LENGTH                   0x00000001

#define _ADMOD1L_SIGN18_POSITION                 0x00000004
#define _ADMOD1L_SIGN18_MASK                     0x00000010
#define _ADMOD1L_SIGN18_LENGTH                   0x00000001

#define _ADMOD1L_DIFF18_POSITION                 0x00000005
#define _ADMOD1L_DIFF18_MASK                     0x00000020
#define _ADMOD1L_DIFF18_LENGTH                   0x00000001

#define _ADMOD1L_SIGN19_POSITION                 0x00000006
#define _ADMOD1L_SIGN19_MASK                     0x00000040
#define _ADMOD1L_SIGN19_LENGTH                   0x00000001

#define _ADMOD1L_DIFF19_POSITION                 0x00000007
#define _ADMOD1L_DIFF19_MASK                     0x00000080
#define _ADMOD1L_DIFF19_LENGTH                   0x00000001

#define _ADMOD1L_SIGN20_POSITION                 0x00000008
#define _ADMOD1L_SIGN20_MASK                     0x00000100
#define _ADMOD1L_SIGN20_LENGTH                   0x00000001

#define _ADMOD1L_DIFF20_POSITION                 0x00000009
#define _ADMOD1L_DIFF20_MASK                     0x00000200
#define _ADMOD1L_DIFF20_LENGTH                   0x00000001

#define _ADMOD1L_SIGN21_POSITION                 0x0000000A
#define _ADMOD1L_SIGN21_MASK                     0x00000400
#define _ADMOD1L_SIGN21_LENGTH                   0x00000001

#define _ADMOD1L_DIFF21_POSITION                 0x0000000B
#define _ADMOD1L_DIFF21_MASK                     0x00000800
#define _ADMOD1L_DIFF21_LENGTH                   0x00000001

#define _ADIEL_IE0_POSITION                      0x00000000
#define _ADIEL_IE0_MASK                          0x00000001
#define _ADIEL_IE0_LENGTH                        0x00000001

#define _ADIEL_IE1_POSITION                      0x00000001
#define _ADIEL_IE1_MASK                          0x00000002
#define _ADIEL_IE1_LENGTH                        0x00000001

#define _ADIEL_IE2_POSITION                      0x00000002
#define _ADIEL_IE2_MASK                          0x00000004
#define _ADIEL_IE2_LENGTH                        0x00000001

#define _ADIEL_IE3_POSITION                      0x00000003
#define _ADIEL_IE3_MASK                          0x00000008
#define _ADIEL_IE3_LENGTH                        0x00000001

#define _ADIEL_IE4_POSITION                      0x00000004
#define _ADIEL_IE4_MASK                          0x00000010
#define _ADIEL_IE4_LENGTH                        0x00000001

#define _ADIEL_IE5_POSITION                      0x00000005
#define _ADIEL_IE5_MASK                          0x00000020
#define _ADIEL_IE5_LENGTH                        0x00000001

