MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS808/mcu.h
#define _LEBCON6_PLR_POSITION                    0x0000000D
#define _LEBCON6_PLR_MASK                        0x00002000
#define _LEBCON6_PLR_LENGTH                      0x00000001

#define _LEBCON6_PHF_POSITION                    0x0000000E
#define _LEBCON6_PHF_MASK                        0x00004000
#define _LEBCON6_PHF_LENGTH                      0x00000001

#define _LEBCON6_PHR_POSITION                    0x0000000F
#define _LEBCON6_PHR_MASK                        0x00008000
#define _LEBCON6_PHR_LENGTH                      0x00000001

#define _LEBDLY6_LEB_POSITION                    0x00000003
#define _LEBDLY6_LEB_MASK                        0x00000FF8
#define _LEBDLY6_LEB_LENGTH                      0x00000009

#define _LEBDLY6_LEB0_POSITION                   0x00000003
#define _LEBDLY6_LEB0_MASK                       0x00000008
#define _LEBDLY6_LEB0_LENGTH                     0x00000001

#define _LEBDLY6_LEB1_POSITION                   0x00000004
#define _LEBDLY6_LEB1_MASK                       0x00000010
#define _LEBDLY6_LEB1_LENGTH                     0x00000001

#define _LEBDLY6_LEB2_POSITION                   0x00000005
#define _LEBDLY6_LEB2_MASK                       0x00000020
#define _LEBDLY6_LEB2_LENGTH                     0x00000001

#define _LEBDLY6_LEB3_POSITION                   0x00000006
#define _LEBDLY6_LEB3_MASK                       0x00000040
#define _LEBDLY6_LEB3_LENGTH                     0x00000001

#define _LEBDLY6_LEB4_POSITION                   0x00000007
#define _LEBDLY6_LEB4_MASK                       0x00000080
#define _LEBDLY6_LEB4_LENGTH                     0x00000001

#define _LEBDLY6_LEB5_POSITION                   0x00000008
#define _LEBDLY6_LEB5_MASK                       0x00000100
#define _LEBDLY6_LEB5_LENGTH                     0x00000001

#define _LEBDLY6_LEB6_POSITION                   0x00000009
#define _LEBDLY6_LEB6_MASK                       0x00000200
#define _LEBDLY6_LEB6_LENGTH                     0x00000001

#define _LEBDLY6_LEB7_POSITION                   0x0000000A
#define _LEBDLY6_LEB7_MASK                       0x00000400
#define _LEBDLY6_LEB7_LENGTH                     0x00000001

#define _LEBDLY6_LEB8_POSITION                   0x0000000B
#define _LEBDLY6_LEB8_MASK                       0x00000800
#define _LEBDLY6_LEB8_LENGTH                     0x00000001

#define _AUXCON6_CHOPLEN_POSITION                0x00000000
#define _AUXCON6_CHOPLEN_MASK                    0x00000001
#define _AUXCON6_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON6_CHOPHEN_POSITION                0x00000001
#define _AUXCON6_CHOPHEN_MASK                    0x00000002
#define _AUXCON6_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON6_CHOPSEL_POSITION                0x00000002
#define _AUXCON6_CHOPSEL_MASK                    0x0000003C
#define _AUXCON6_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON6_BLANKSEL_POSITION               0x00000008
#define _AUXCON6_BLANKSEL_MASK                   0x00000F00
#define _AUXCON6_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON6_HRDDIS_POSITION                 0x0000000E
#define _AUXCON6_HRDDIS_MASK                     0x00004000
#define _AUXCON6_HRDDIS_LENGTH                   0x00000001

#define _AUXCON6_HRPDIS_POSITION                 0x0000000F
#define _AUXCON6_HRPDIS_MASK                     0x00008000
#define _AUXCON6_HRPDIS_LENGTH                   0x00000001

#define _AUXCON6_CHOPSEL0_POSITION               0x00000002
#define _AUXCON6_CHOPSEL0_MASK                   0x00000004
#define _AUXCON6_CHOPSEL0_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL1_POSITION               0x00000003
#define _AUXCON6_CHOPSEL1_MASK                   0x00000008
#define _AUXCON6_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL2_POSITION               0x00000004
#define _AUXCON6_CHOPSEL2_MASK                   0x00000010
#define _AUXCON6_CHOPSEL2_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL3_POSITION               0x00000005
#define _AUXCON6_CHOPSEL3_MASK                   0x00000020
#define _AUXCON6_CHOPSEL3_LENGTH                 0x00000001

#define _AUXCON6_BLANKSEL0_POSITION              0x00000008
#define _AUXCON6_BLANKSEL0_MASK                  0x00000100
#define _AUXCON6_BLANKSEL0_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL1_POSITION              0x00000009
#define _AUXCON6_BLANKSEL1_MASK                  0x00000200
#define _AUXCON6_BLANKSEL1_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL2_POSITION              0x0000000A
#define _AUXCON6_BLANKSEL2_MASK                  0x00000400
#define _AUXCON6_BLANKSEL2_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL3_POSITION              0x0000000B
#define _AUXCON6_BLANKSEL3_MASK                  0x00000800
#define _AUXCON6_BLANKSEL3_LENGTH                0x00000001

#define _PWMCON7_IUE_POSITION                    0x00000000
#define _PWMCON7_IUE_MASK                        0x00000001
#define _PWMCON7_IUE_LENGTH                      0x00000001

#define _PWMCON7_XPRES_POSITION                  0x00000001
#define _PWMCON7_XPRES_MASK                      0x00000002
#define _PWMCON7_XPRES_LENGTH                    0x00000001

#define _PWMCON7_CAM_POSITION                    0x00000002
#define _PWMCON7_CAM_MASK                        0x00000004
#define _PWMCON7_CAM_LENGTH                      0x00000001

#define _PWMCON7_MTBS_POSITION                   0x00000003
#define _PWMCON7_MTBS_MASK                       0x00000008
#define _PWMCON7_MTBS_LENGTH                     0x00000001

#define _PWMCON7_DTC_POSITION                    0x00000006
#define _PWMCON7_DTC_MASK                        0x000000C0
#define _PWMCON7_DTC_LENGTH                      0x00000002

#define _PWMCON7_MDCS_POSITION                   0x00000008
#define _PWMCON7_MDCS_MASK                       0x00000100
#define _PWMCON7_MDCS_LENGTH                     0x00000001

#define _PWMCON7_ITB_POSITION                    0x00000009
#define _PWMCON7_ITB_MASK                        0x00000200
#define _PWMCON7_ITB_LENGTH                      0x00000001

#define _PWMCON7_TRGIEN_POSITION                 0x0000000A
#define _PWMCON7_TRGIEN_MASK                     0x00000400
#define _PWMCON7_TRGIEN_LENGTH                   0x00000001

#define _PWMCON7_CLIEN_POSITION                  0x0000000B
#define _PWMCON7_CLIEN_MASK                      0x00000800
#define _PWMCON7_CLIEN_LENGTH                    0x00000001

#define _PWMCON7_FLTIEN_POSITION                 0x0000000C
#define _PWMCON7_FLTIEN_MASK                     0x00001000
#define _PWMCON7_FLTIEN_LENGTH                   0x00000001

#define _PWMCON7_TRGSTAT_POSITION                0x0000000D
#define _PWMCON7_TRGSTAT_MASK                    0x00002000
#define _PWMCON7_TRGSTAT_LENGTH                  0x00000001

#define _PWMCON7_CLSTAT_POSITION                 0x0000000E
#define _PWMCON7_CLSTAT_MASK                     0x00004000
#define _PWMCON7_CLSTAT_LENGTH                   0x00000001

#define _PWMCON7_FLTSTAT_POSITION                0x0000000F
#define _PWMCON7_FLTSTAT_MASK                    0x00008000
#define _PWMCON7_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON7_DTC0_POSITION                   0x00000006
#define _PWMCON7_DTC0_MASK                       0x00000040
#define _PWMCON7_DTC0_LENGTH                     0x00000001

#define _PWMCON7_DTC1_POSITION                   0x00000007
#define _PWMCON7_DTC1_MASK                       0x00000080
#define _PWMCON7_DTC1_LENGTH                     0x00000001

#define _IOCON7_OSYNC_POSITION                   0x00000000
#define _IOCON7_OSYNC_MASK                       0x00000001
#define _IOCON7_OSYNC_LENGTH                     0x00000001

#define _IOCON7_SWAP_POSITION                    0x00000001
#define _IOCON7_SWAP_MASK                        0x00000002
#define _IOCON7_SWAP_LENGTH                      0x00000001

#define _IOCON7_CLDAT_POSITION                   0x00000002
#define _IOCON7_CLDAT_MASK                       0x0000000C
#define _IOCON7_CLDAT_LENGTH                     0x00000002

#define _IOCON7_FLTDAT_POSITION                  0x00000004
#define _IOCON7_FLTDAT_MASK                      0x00000030
#define _IOCON7_FLTDAT_LENGTH                    0x00000002

#define _IOCON7_OVRDAT_POSITION                  0x00000006
#define _IOCON7_OVRDAT_MASK                      0x000000C0
#define _IOCON7_OVRDAT_LENGTH                    0x00000002

